INSERT INTO property_types (type_name) VALUES 
('Квартира'),
('Дом'),
('Апартаменты');

-- Добавление данных в таблицу "Районы"
INSERT INTO districts (district_name) VALUES
('Центральный'),
('Северный'),
('Южный'),
('Восточный');

-- Добавление данных в таблицу "Материалы здания"
INSERT INTO building_materials (material_name) VALUES
('Панель'),
('Кирпич');

-- Добавление данных в таблицу "Критерии оценки"
INSERT INTO evaluation_criteria (criterion_name) VALUES
('Экология'),
('Чистота'),
('Соседи'),
('Условия для детей'),
('Магазины'),
('Безопасность');

-- Добавление данных в таблицу "Риэлтор"
INSERT INTO realtors (last_name, first_name, patronymic, contact_phone) VALUES
('Иванов', 'Иван', 'Иванович', '123-456-7890'),
('Петров', 'Петр', 'Петрович', '987-654-3210'),
('Сидоров', 'Сидор', 'Сидорович', '555-555-5555'),
('Александров', 'Александр', 'Александрович', '111-222-3333'),
('Николаев', 'Николай', 'Николаевич', '444-444-4444');

-- Добавление данных в таблицу "Продажи"
INSERT INTO sales (object_id, sale_date, realtor_id, cost) VALUES
(1, '2024-03-14', 1, 100000),
(2, '2024-03-15', 2, 150000),
(3, '2024-03-16', 3, 200000),
(4, '2024-03-17', 4, 250000),
(5, '2024-03-18', 5, 300000);